; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	thermograph2 - mode
	spectrograph1 - mode
	thermograph4 - mode
	spectrograph3 - mode
	thermograph0 - mode
	Star2 - direction
	GroundStation8 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation6 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star7 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph4)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 thermograph4)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument5 spectrograph1)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph4)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 GroundStation6)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 Star7)
	(supports instrument7 spectrograph1)
	(supports instrument7 spectrograph3)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star7)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
)
(:goal (and
	(pointing satellite0 GroundStation8)
	(pointing satellite2 GroundStation6)
	(have_image Star9 spectrograph1)
	(have_image Star10 spectrograph1)
	(have_image Phenomenon11 spectrograph1)
	(have_image Star12 spectrograph3)
	(have_image Phenomenon13 spectrograph1)
))

)

; plan
1. (turn_to satellite0 groundstation5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 7
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
3. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite0 star10 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star10)
   goals met: 0 of 7
5. (take_image satellite0 star10 instrument1 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 1 of 7
6. (turn_to satellite0 phenomenon13 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 7
7. (take_image satellite0 phenomenon13 instrument1 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon11 instrument1 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 3 of 7
10. (turn_to satellite0 star12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star12)
   goals met: 3 of 7
11. (take_image satellite0 star12 instrument1 spectrograph3)
   added: (have_image star12 spectrograph3)
   goals met: 4 of 7
12. (turn_to satellite0 star9 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star9)
   goals met: 4 of 7
13. (take_image satellite0 star9 instrument1 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 5 of 7
14. (turn_to satellite0 groundstation8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation8)
   goals met: 6 of 7
15. (turn_to satellite2 groundstation6 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 groundstation6)
   goals met: 7 of 7
